content/post/The-little-schemer-note.md
+++
title = "The Little Schemer speedy referring note (1/3)"
date = 2019-12-10T23:20:00+00:00
lastmod = 2020-05-14T21:09:20+01:00
categories = ["TECH"]
draft = false
image = "img/111.jpg"
+++

The Little Schemer uses a very easy way, introducing the nature of recursion,
continuation and Y combinator with only several simple building blocks. You might
have been so used to writing and calling functions with formal name, this book
will show you how complex procedure can be reformed by lambda expressions.

This is a quick reference note that I pull from the book The Little Schemer. The
full detailed code can be found in this repo:

[the-little-schemer/02-do-it-again.ss at master · pkrumins/the-little-schemer](https://github.com/pkrumins/the-little-schemer/blob/master/02-do-it-again.ss)

My recommendation of reading this book is that don't skip too much questions
after the fifth chapter, as the functions getting more complex, you will find those
questions from the dialogue are carefully asked, in order to guide us to gradually write a better program. Meanwhile try to write functions with pens and papers before checking the
answer, and often review them with quick scan of this article. I really enjoy this book, and hope you have much fun as I do :).

From some point, you probably need to read "Fibonacci times" in every chapter to fully
understand but keep going, you won't regret it.


## Chapter 1 Toy {#chapter-1-toy}

In this chapter, we list primitive conceptions and functions which will be
used through the entire book:

---

**atom** is the smallest element, something NOT enclosed by pair of
parenthesis: a string of digits/characters/numbers.

**list** is something enclosed by pair of parenthesis: something can be nothing, can be
atom, can be another list.

**s-expression** can be an atom, or an expression of the form (x y) where x and
y are s-expressions. It's essentially a binary tree.

`(car argument)`: returns first s-expression among all the first-level
 s-expression within a list. It can NOT work on empty list.

`(cdr argument)`: returns the complement set of `(car argument)`, including
the parenthesis. It can return empty list but can NOT work on non-list input.

`car/cdr` both take and output non-empty list. `cdr` cannot work on null list or
atom. For `(han), han, ()` cdr can only work on the first.

`(cons argument1 argument2)`: add arg1 (s-exp) onto arg2 (list), the output is
 list.

`(null? argument)`: returns T when the argument(list) is `(quote()), '() and ()` returns
 error when argument is `atom`; returns F for others.

`(atom? argument)`: checks if the argument (any s-expression) is atom.

`(eq? argument1 argument2)`: returns T when arguments (atoms) are equal; returns
 error when arguments are numerical or list; returns F for others.

`(or argument1 argument2 ...)` checks predicate arguments one by one. It terminates
whenever the first T is found and returns T, otherwise it returns F.

`(and argument1 argument2 ...)` checks predicate arguments one by one. It terminates
whenever the first F is found and returns F, otherwise it returns T.


## Chapter 2 Do It Again and Again {#chapter-2-do-it-again-and-again}

From chapter 2, we begin to build functions with primitive building blocks.

---

`(lat? argument)`: checks if every s-expression in a list is atom. Since the
 s-expression is either atom or list/pair, `(lat?)` use `(atom?)` as core function.

{{< highlight scheme >}}
;define atom? as primitive function first:
  ;define atom? as primitive function first:
  (define atom?
   (lambda (x)
      (and (not (pair? x)) (not (null? x)))))

  ; (lat? (Jack Sprat could eat no chicken fat)) -> #t, for every element is atom.
  (define lat?
    (lambda (l)
      (cond
        ((null? l) #t)
        ((atom? (car l)) (lat? (cdr l)))
        (else #f))))
{{< /highlight >}}

 `(member? argument1 argument2)`: checks if the argument1 (an atom) is in
the argument2 (a non-empty list).

{{< highlight scheme >}}
; (member? meat (mashed potatoes and meat gravy)) -> #t, for meat is in the list.
  ; (member? meat (mashed potatoes and meat gravy)) -> #t, for meat is in the list.
  (define member?
    (lambda (a lat)
      (cond
        ((null? lat) #f)
        (else (or (eq? (car lat) a)
                  (member? a (cdr lat)))))))
{{< /highlight >}}
