content/post/The-little-schemer-note.md


## Chapter 3 Cons the Magnificent {#chapter-3-cons-the-magnificent}

---

 `(rember argument1 argument2)`: removes the first occurrence of the argument1 (an atom) from
the argument2 (a non-empty list).

{{< highlight scheme >}}
; (rember cup (coffee cup tea cup and hick cup)) -> (coffee tea cup and hick cup)
  ; (rember cup (coffee cup tea cup and hick cup)) -> (coffee tea cup and hick cup)
  (define rember
    (lambda (a lat)
      (cond
        ((null? lat) '())
        ((eq? (car lat) a) (cdr lat))
        (else (cons (car lat)
                    (rember a (cdr lat)))))))
{{< /highlight >}}

`(first argument)`: the argument is a non-empty list, possibly consists of more
lists. The function returns a list consists of all the first s-expressions within
the first level argument lists.

{{< highlight scheme >}}
; (firsts ((five plums) (four) (eleven green oranges))) -> (five four eleven)
  ; (firsts ((five plums) (four) (eleven green oranges))) -> (five four eleven)
  (define firsts
    (lambda (l)
      (cond
        ((null? l) '())
        (else
          (cons (car (car l)) (firsts (cdr l)))))))
{{< /highlight >}}

`(insetR new old lat)` and `(insetL new old lat)`: insert the _new_ atom at the
RIGHT/LEFT side of the _old_ atom in lat (a list).

{{< highlight scheme >}}
; (insertR topping fudge (ice cream with fudge for dessert)) -> (ice cream with fudge topping for dessert)
  ; (insertR topping fudge (ice cream with fudge for dessert)) -> (ice cream with fudge topping for dessert)
  (define insertR
    (lambda (new old lat)
      (cond
        ((null? lat) '())
        ((eq? (car lat) old)
         (cons old (cons new (cdr lat))))
        (else
          (cons (car lat) (insertR new old (cdr lat)))))))

  ; (insertL topping fudge (ice cream with fudge for dessert)) -> (ice cream with topping fudge for dessert)
  (define insertL
    (lambda (new old lat)
      (cond
        ((null? lat) '())
        ((eq? (car lat) old)
         (cons new (cons old (cdr lat))))
        (else
          (cons (car lat) (insertL new old (cdr lat)))))))
{{< /highlight >}}

`(subst new old lat)`: in lat (a list), this function replaces old atom with new
atom.
`(subst2 new o1 o2 lat)`: in lat (a list), this function checks o1 o2, whichever
occurs firstly is replaced by new atom.

{{< highlight scheme >}}
; (subst topping fudge (ice cream with fudge for dessert)) -> (ice cream with topping for dessert)
  ; (subst topping fudge (ice cream with fudge for dessert)) -> (ice cream with topping for dessert)
    (define subst
      (lambda (new old lat)
        (cond
          ((null? lat) '())
          ((eq? (car lat) old)
           (cons new (cdr lat)))
          (else
            (cons (car lat) (subst new old (cdr lat)))))))

  ; (subst2 vanilla chocolate banana (banana ice cream with chocolate topping)) ->
  ; (vanilla ice cream with chocolate topping)
    (define subst2
      (lambda (new o1 o2 lat)
        (cond
          ((null? lat) '())
          ((or (eq? (car lat) o1) (eq? (car lat) o2))
           (cons new (cdr lat)))
          (else
            (cons (car lat) (subst new o1 o2 (cdr lat)))))))
{{< /highlight >}}

From now on, we use recursion more than once, in different predicates to achieve
multiple assignments, or more complicated assignments. For example, putting a
recursion in `(eq?)` predicate, in `(rember)` function enables us to go deeper,
removing multiple occurred atoms.
`(multirember a lat)`: removes all the occurrences of a in lat (a list).
`(multiinsertR new old lat)` and `(multiinsertL new old lat)`: insert new atom at the
RIGHT/LEFT side of old atom for EVERY occurrence of old in lat (a list).

{{< highlight scheme >}}
; (multirember cup (coffee cup tea cup and hick cup)) -> (coffee tea and hick)
  ; (multirember cup (coffee cup tea cup and hick cup)) -> (coffee tea and hick)
  (define multirember
    (lambda (a lat)
      (cond
        ((null? lat) '())
        ((eq? (car lat) a)
         (multirember a (cdr lat)))
        (else
          (cons (car lat) (multirember a (cdr lat)))))))

  ; (multiinsertR x a (a b c d e a a b)) -> (a x b c d e a x a x b)
  (define multiinsertR
    (lambda (new old lat)
      (cond
        ((null? lat) '())
        ((eq? (car lat) old)
         (cons old (cons new (multiinsertR new old (cdr lat)))))
        (else
          (cons (car lat) (multiinsertR new old (cdr lat)))))))

  ; (multiinsertL x a (a b c d e a a b)) -> (x a b c d e x a x a b)
  (define multiinsertL
    (lambda (new old lat)
      (cond
        ((null? lat) '())
        ((eq? (car lat) old)
         (cons new (cons old (multiinsertL new old (cdr lat)))))
        (else
          (cons (car lat) (multiinsertL new old (cdr lat)))))))
{{< /highlight >}}

`(multirsubst new old lat)`: replaces old atom with new atom for EVERY occurrence
of old atom in lat (a list).

{{< highlight scheme >}}
; (multisubst x a (a b c d e a a b)) -> (x b c d e x x b)
  ; (multisubst x a (a b c d e a a b)) -> (x b c d e x x b)
  define multisubst
    (lambda (new old lat)
      (cond
        ((null? lat) '())
        ((eq? (car lat) old)
         (cons new (multisubst new old (cdr lat))))
        (else
          (cons (car lat) (multisubst new old (cdr lat)))))))
{{< /highlight >}}

The multi operation is generally better designed. It can work with both single
and multiple occurrences of old atoms, and terminate at until it's got null
list. But the single operations terminate right when the first `(eq?)` returns
T. Generally applicable termination should be at finishing the last element.
