content/post/The-little-schemer-note.md


## Chapter 4 Number Games {#chapter-4-number-games}

To start, we only consider _whole_ and _positive_ number. We are going to
firstly build increment function `(add1 argument)`, and decrement function
`(sub1 argument)`; then using them as fundamental blocks, we build addition
`(o+)` and subtraction `(o-)`; again using addtion as building block, we build multiplication.
It can be sensed that these recursive paradigm is exactly how we establish all more
calculation algorithms.

{{< highlight scheme >}}
;(add1 67) -> 68
  ;(add1 67) -> 68
  (define add1
    (lambda (n) (+ n 1)))

  ;(sub1 5) -> 4
  (define sub1
    (lambda (n) (- n 1)))

  ;(o+ 46 12) -> 58
  (define o+
    (lambda (n m)
      (cond
        ((zero? m) n)
        (else (add1 (o+ n (sub1 m)))))))

  ;(o- 14 3) -> 11
  (define o-
    (lambda (n m)
      (cond
        ((zero? m) n)
        (else (sub1 (o- n (sub1 m)))))))

  ;(o* 5 3) -> 15
  (define o*
    (lambda (n m)
      (cond
        ((zero? m) 0)
        (else (o+ n (o* n (sub1 m)))))))
{{< /highlight >}}

Next we introduce new class tuple (tup). **tup** is either an empty list, or it contains a number and a rest that is also a **tup**.

Using tup as building block to create extent function is just as using list before.
To enable natural termination on a list we use `(null? list)` and on a number we
use `(zero? 0)`. To enable the natural termination on a tup we use `(null? tup)`.

To enable natural recursion on a list we use `(cdr argument)`; the natural recursion on a
tup we use `(cdr argument)`; the natural recursion on a number we use `(sub1
argument)`. These condition is reused as new argument in inner recursion as
stated in The Fourth Commandment.

For tup, we develop two functions for fun:

{{< highlight scheme >}}
;(addtup (3 5 2 8)) -> 18
  ;(addtup (3 5 2 8)) -> 18
  (define addtup
    (lambda (tup)
      (cond
        ((null? tup) 0)
        (else (o+ (car tup) (addtup (cdr tup)))))))

  ;(tup+ (3 6 9 11 4) (8 5 2 0 7)) -> (11 11 11 11 11)
  (define tup+
    (lambda (tup1 tup2)
      (cond
        ((null? tup1) tup2)
        ((null? tup2) tup1)
        (else
          (cons (o+ (car tup1) (car tup2))
                (tup+ (cdr tup1) (cdr tup2)))))))
{{< /highlight >}}

The second case shows case need more than one terminal conditions. Using `(and
(null? tup1) (null? tup2))` is wrong when tup1 and tup2 have different length.
In such case, we use multiple terminal conditions and it works not only to finish the recursion,
but also to delivery the key result.

Back to the number game, we continuous use the foundamental blocks to creat:

{{< highlight scheme >}}
;(o> 12 133) -> #f
  ;(o> 12 133) -> #f
  (define o>
    (lambda (n m)
      (cond
        ((zero? n) #f)
        ((zero? m) #t)
        (else
          (o> (sub1 n) (sub1 m))))))

  ;(o< 4 6) -> #t
  (define o<
    (lambda (n m)
      (cond
        ((zero? m) #f)
        ((zero? n) #t)
        (else
          (o< (sub1 n) (sub1 m))))))

  ;(o= 5 5) -> #t
  (define o=
    (lambda (n m)
      (cond
        ((o> n m) #f)
        ((o< n m) #f)
        (else #t))))

  ;(o^ 2 3) -> 8
  (define o^
    (lambda (n m)
      (cond
        ((zero? m) 1)
        (else (o* n (o^ n (sub1 m)))))))

  ;(o/ 15 4) -> 3
  (define o/
    (lambda (n m)
      (cond
        ((o< n m) 0)
        (else (add1 (o/ (o- n m) m))))))
{{< /highlight >}}

In the `o> and o<` we can see again that the terminating conditions not only
terminate recursions,
but also work in a carefully arranged order, to deliver the right results for
designated function.

{{< highlight scheme >}}
;(olength (hotdogs with mustard sauerkraut and pickles)) -> 6
  ;(olength (hotdogs with mustard sauerkraut and pickles)) -> 6
  (define olength
    (lambda (lat)
      (cond
        ((null? lat) 0)
        (else (add1 (olength (cdr lat)))))))

  ;(pick 4 (lasagna spaghetti ravioli macaroni meatball)) -> macaroni
  (define pick
    (lambda (n lat)
      (cond
        ((zero? (sub1 n)) (car lat))
        (else
          (pick (sub1 n) (cdr lat))))))

  ;(rempick 3 (hotdogs with hot mustard)) -> (hotdogs with mustard)
  (define rempick
    (lambda (n lat)
      (cond
        ((zero? (sub1 n)) (cdr lat))
        (else
          (cons (car lat) (rempick (sub1 n) (cdr lat)))))))
{{< /highlight >}}

and number

{{< highlight scheme >}}
;(no-nums '(5 pears 6 prunes 9 dates)) -> (pears prunes dates)
  ;(no-nums '(5 pears 6 prunes 9 dates)) -> (pears prunes dates)
  (define no-nums
      (lambda (lat)
        (cond
          ((null? lat) '())
          ((number? (car lat)) (no-nums (cdr lat)))
          (else
            (cons (car lat) (no-nums (cdr lat)))))))

  ;(all-nums '(5 pears 6 prunes 9 dates)) -> (5 6 9)
    (define all-nums
      (lambda (lat)
        (cond
          ((null? lat) '())
          ((number? (car lat)) (cons (car lat) (all-nums (cdr lat))))
          (else
            (all-nums (cdr lat))))))

  ;(eqan? 'a 'a) -> #t
    (define eqan?
      (lambda (a1 a2)
        (cond
          ((and (number? a1) (number? a2)) (= a1 a2))
          ((or  (number? a1) (number? a2)) #f)
          (else
            (eq? a1 a2)))))

  ;(occur 'x '(a b x x c d x)) -> 3
    (define occur
      (lambda (a lat)
        (cond
          ((null? lat) 0)
          ((eq? (car lat) a)
           (add1 (occur a (cdr lat))))
          (else
            (occur a (cdr lat))))))

  ;  (one? 5) -> #f
  (define one?
      (lambda (n) (= n 1)))

  ;(rempick-one 4 '(hotdogs with hot mustard)) -> '(hotdogs with mustard)
  (define rempick-one
      (lambda (n lat)
        (cond
          ((one? n) (cdr lat))
          (else
            (cons (car lat) (rempick-one (sub1 n) (cdr lat)))))))
{{< /highlight >}}
