content/post/The-little-schemer-note.md


## Chapter 5 It's Full Of Stars {#chapter-5-it-s-full-of-stars}

The starred function family re-write the functions in previous chapters with a
bit more recursions. The purpose is to achieve higher level of
mission, or to make the work more thoroughly.

---

For example, `(rember a l)` removes multiple occurrences of `a` as the _first level_ s-expression of list `l`, whereas `(rember* a l)`
removes `a` as _any level_ s-expressions. This is done by changing one more
condition in the outer `(else)` by recusion. We can also improve insertR\*,
insertL\*, occur\*, subst\* and member\* in the same way.

{{< highlight scheme >}}
; (rember* 'cup '((coffee) cup ((tea) cup) (and (hick)) cup))
  ; (rember* 'cup '((coffee) cup ((tea) cup) (and (hick)) cup))
  ; -> '((coffee) ((tea)) (and (hick)))
  (define rember*
    (lambda (a l)
      (cond
        ((null? l) '())
        ((atom? (car l))
         (cond
           ((eq? (car l) a)
            (rember* a (cdr l)))
           (else
             (cons (car l) (rember* a (cdr l))))))
        (else
          (cons (rember* a (car l)) (rember* a (cdr l)))))))

  ;(insertR* 'roast 'chuck
  ;  '((how much (wood)) could ((a (wood) chuck)) (((chuck))) (if (a) ((wood chuck))) could chuck wood))
  ; -> ((how much (wood)) could ((a (wood) chuck roast)) (((chuck roast)))
  (define insertR*
    (lambda (new old l)
      (cond
        ((null? l) '())
        ((atom? (car l))
         (cond
           ((eq? (car l) old)
            (cons old (cons new (insertR* new old (cdr l)))))
           (else
             (cons (car l) (insertR* new old (cdr l))))))
        (else
          (cons (insertR* new old (car l)) (insertR* new old (cdr l)))))))

  ;(insertL* 'pecker 'chuck
  ;  '((how much (wood)) could ((a (wood) chuck)) (((chuck))) (if (a) ((wood chuck))) could chuck wood))
  ; -> ((how much (wood)) could ((a (wood) chuck pecker)) (((chuck pecker))) (if (a) ((wood chuck pecker))) could chuck pecker wood)
  (define insertL*
    (lambda (new old l)
      (cond
        ((null? l) '())
        ((atom? (car l))
         (cond
           ((eq? (car l) old)
            (cons new (cons old (insertL* new old (cdr l)))))
           (else
             (cons (car l) (insertL* new old (cdr l))))))
        (else
          (cons (insertL* new old (car l)) (insertL* new old (cdr l)))))))

  ;(occur* 'banana '((banana) (split ((((banana ice))) (cream (banana)) sherbet)) (banana) (bread) (banana brandy)))
  ; -> 5
  (define occur*
    (lambda (a l)
      (cond
        ((null? l) 0)
        ((atom? (car l))
         (cond
           ((eq? (car l) a)
            (add1 (occur* a (cdr l))))
           (else
             (occur* a (cdr l)))))
        (else
          (+ (occur* a (car l))
             (occur* a (cdr l)))))))

  ;(subst* 'orange 'banana
  ;  '((banana) (split ((((banana ice))) (cream (banana)) sherbet)) (banana) (bread) (banana brandy)))
  ; -> '((orange) (split ((((orange ice))) (cream (orange)) sherbet)) (orange) (bread) (orange brandy))
  (define subst*
    (lambda (new old l)
      (cond
        ((null? l) '())
        ((atom? (car l))
         (cond
           ((eq? (car l) old)
            (cons new (subst* new old (cdr l))))
           (else
             (cons (car l) (subst* new old (cdr l))))))
        (else
          (cons (subst* new old (car l)) (subst* new old (cdr l)))))))

  ;(member 'chips '((potato) (chips ((with) fish) (chips)))) -> #t
  (define member*
    (lambda (a l)
      (cond
        ((null? l) #f)
        ((atom? (car l))
         (or (eq? (car l) a)
             (member* a (cdr l))))
        (else
          (or (member* a (car l))
              (member* a (cdr l)))))))
{{< /highlight >}}

The starred functions require more predicates to consider all possibile
situations. After observing the design pattern in the above functions, we
would see that they all asked three fundamental questions: **(1) Is the list null?
(2) If not, is the `(car argument)` an atom? (3) If yes, is the predicate
`(eq?)` true?** It is these questions that enable a
function to work on any cases with: empty list; atom _consed_ to a list; list
_consed_ to a list.

Let's see another function:

{{< highlight scheme >}}
;(leftmost '((potato) (chips ((with) fish) (chips)))) -> 'potato
  ;(leftmost '((potato) (chips ((with) fish) (chips)))) -> 'potato
  (define leftmost
    (lambda (l)
      (cond
        ((atom? (car l)) (car l))
        (else (leftmost (car l))))))
{{< /highlight >}}

As comparison, this function shows a case where only ONE question is
asked, therefore it works on less types of argument than the starred functions. But
there is more: you may noticed that there were TWO questions checked above. The `(null?)` and `(atom?)`
are achieved by one predicate with some self deducted logic: if the list is null, the `(atom? car(lat))`
would also return F and the recursion in `(else)` will still be called. This type of
simplification will help us to improve functions into a pithy fashion.

For example, we write `(eqlist?)` to check the equality of two lists. Based on
the 3 golden questions we asked for operating ONE list, designing two lists operation
will require asking 3\*3 = 9 predicates (in permutation), and the `(eq?)` is happening when both of the
arguments are atoms:

{{< highlight scheme >}}
;(eqlist? '(strawberry ice cream) '(strawberry ice cream)) -> #t
  ;(eqlist? '(strawberry ice cream) '(strawberry ice cream)) -> #t
  (define eqlist?
    (lambda (l1 l2)
      (cond
        ; case 1: l1 is empty, l2 is empty, atom, list
        ((and (null? l1) (null? l2)) #t)
        ((and (null? l1) (atom? (car l2))) #f)
        ((null? l1) #f); the above predicates have ruled out l2 is empty or list
        ; case 2: l1 is atom, l2 is empty, atom, list
        ((and (atom? (car l1)) (null? l2)) #f)
        ((and (atom? (car l1)) (atom? (car l2)))
         (and (eq? (car l1) (car l2))
              (eqlist? (cdr l1) (cdr l2))))
        ((atom? (car l1)) #f)
        ; case 3: l1 is a list, l2 is empty, atom, list
        ((null? l2) #f)
        ((atom? (car l2)) #f)
        (else
          (and (eqlist? (car l1) (car l2))
               (eqlist? (cdr l1) (cdr l2)))))))

  ;(eqlist2? '(a (b c)) '(a (b c))) -> #t
  (define eqlist2?
    (lambda (l1 l2)
      (cond
        ; case 1: l1 is empty, l2 is empty, atom, list
        ((and (null? l1) (null? l2)) #t)
        ((or (null? l1) (null? l2)) #f)
        ; case 2: l1 is atom, l2 is empty, atom, list
        ((and (atom? (car l1)) (atom? (car l2)))
         (and (eq? (car l1) (car l2))
              (eqlist2? (cdr l1) (cdr l2))))
        ((or (atom? (car l1)) (atom? (car l2)))
         #f)
        ; case 3: l1 is a list, l2 is empty, atom, list
        (else
          (and (eqlist2? (car l1) (car l2))
               (eqlist2? (cdr l1) (cdr l2)))))))
{{< /highlight >}}

Notice that the third predicate can be written as `(null? l1) #f)` because `(cond)` excutes the
predicate one by one. Means that the second predicate gets to run **only when** the
first predicate returns #f which gives us information for inference.  It's not
quite pithy, so in the `(eqlist2?)` we merge some of the redundant #f predicates together
with `(or)`.

This can be further simplified by introducing an S-expression comparison
function `(equal?)`, which itself can be also written in the simplified way as `(eqlist2?)`.

{{< highlight scheme >}}
;(equal? '(a) '(a)) -> #t
  ;(equal? '(a) '(a)) -> #t
  (define equal?
    (lambda (s1 s2)
      (cond
        ((and (atom? s1) (atom? s2))
         (eq? s1 s2))
        ((or (atom? s1) (atom? s2)) #f)
        (else (equal? s1 s2)))))

  ;(eqlist3?
  ;  '(beef ((sausage)) (and (soda)))
  ;  '(beef ((salami)) (and (soda)))) -> #f
  (define eqlist3?
    (lambda (l1 l2)
      (cond
        ((and (null? l1) (null? l2)) #t)
        ((or (null? l1) (null? l2)) #f)
        (else
          (and (equal? (car l1) (car l2))
               (equal? (cdr l1) (cdr l2)))))))
{{< /highlight >}}

After defining `(eqlist?)` to compare the equality of two lists, we can further
improve `(rember)` to remove **lists** as argument, not just removing atoms like in the
previous chapter.

{{< highlight scheme >}}
;(rember '(foo (bar (baz))) '(apples (foo (bar (baz))) oranges)) -> '(apples oranges)
  ;(rember '(foo (bar (baz))) '(apples (foo (bar (baz))) oranges)) -> '(apples oranges)
  (define rember
    (lambda (s l)
      (cond
        ((null? l) '())
        ((equal2?? (car l) s) (cdr l))
        (else (cons (car l) (rember s (cdr l)))))))
{{< /highlight >}}

This chapter establish rules to write a good functions `(1) the first thing is to write ALL the operations
for every predicate condition; (2) make sure the algorithm is correct; (3) then to simplify it.`
