content/post/The-little-schemer-note.md


## Chapter 6 Shadows {#chapter-6-shadows}

---

An arithmetic expression (aexp) is either an atom or two arithmetic
expression combined by o+, o\* , ^. `(numbered? argument)` return #f if the
argument contains anything other than numbers and o+, o\* , ^.

{{< highlight scheme >}}
;(numbered? '(5 ox (3 'foo 2))) -> #f
  ;(numbered? '(5 ox (3 'foo 2))) -> #f
  (define numbered?
    (lambda (aexp)
      (cond
        ((atom? aexp) (number? aexp))
        ((eq? (car (cdr aexp)) 'o+)
         (and (numbered? (car aexp))
              (numbered? (car (cdr (cdr aexp))))))
        ((eq? (car (cdr aexp)) 'ox)
         (and (numbered? (car aexp))
              (numbered? (car (cdr (cdr aexp))))))
        ((eq? (car (cdr aexp)) 'o^)
         (and (numbered? (car aexp))
              (numbered? (car (cdr (cdr aexp))))))
        (else #f))))

  ;if we are only allowed to input numeric expression, we can simplify as:
  (define numbered?
    (lambda (aexp)
      (cond
        ((atom? aexp) (number? aexp))
        (else
          (and (numbered? (car aexp))
               (numbered? (car (cdr (cdr aexp)))))))))
{{< /highlight >}}

The function `(value argument)` print the calculated value of a numberic
expression: when the argument is a single atom, it prints itself; when the
argument is conpound, meaning more sub-expressions joint by operator, it
recursively runs until hits a single atom, and then the aggregate calculation is
done from inside to outside. However, notice that the predicate changes according to the syntax
setting of numeric expressions, taking addition as example:

{{< highlight scheme >}}
;(1 + 1) is written as:
  ;(1 + 1) is written as:
   ((eq? (car (cdr nexp)) 'o+)

  ;(+ 1 1) is written as:
   ((eq? (car nexp) 'o+)
{{< /highlight >}}

So the `(value)` can be written in two forms:

{{< highlight scheme >}}
;(value '(1 o+ (3 o^ 4))) ->82
  ;(value '(1 o+ (3 o^ 4))) ->82
    (define value
      (lambda exp)
        (cond
          ((atom? nexp) nexp)
          ((eq? (car (cdr nexp)) 'o+)
           (+ (value (car nexp))
              (value (car (cdr (cdr nexp))))))
          ((eq? (car (cdr nexp)) 'o*)
           (* (value (car nexp))
              (value (car (cdr (cdr nexp))))))
          ((eq? (car (cdr nexp)) 'o^)
           (expt (value (car nexp))
                 (value (car (cdr (cdr nexp))))))
          (else #f))))

  ;(value-prefix '(o+ 1 (o^ 3 4))) -> 82
  (define value-prefix
      (lambda (nexp)
        (cond
          ((atom? nexp) nexp)
          ((eq? (car nexp) 'o+)
           (+ (value-prefix (car (cdr nexp)))
              (value-prefix (car (cdr (cdr nexp))))))
          ((eq? (car nexp) 'o*)
           (* (value-prefix (car (cdr nexp)))
              (value-prefix (car (cdr (cdr nexp))))))
          ((eq? (car nexp) 'o^)
           (expt (value-prefix (car (cdr nexp)))
                 (value-prefix (car (cdr (cdr nexp))))))
          (else #f))))
{{< /highlight >}}

For this type of prefixed operator syntax, we can rewrite it with pre-defined
1st and 2nd sub-expressions:

{{< highlight scheme >}}
(define 1st-sub-exp
  (define 1st-sub-exp
    (lambda (aexp)
      (car aexp)))

  (define 2nd-sub-exp
    (lambda (aexp)
      (car (cdr (cdr aexp)))))

  (define operator
    (lambda (aexp)
      (car (cdr aexp))))

  (define value-prefix-helper
    (lambda (nexp)
      (cond
        ((atom? nexp) nexp)
        ((eq? (operator nexp) 'o+)
         (+ (value-prefix (1st-sub-exp nexp))
            (value-prefix (2nd-sub-exp nexp))))
        ((eq? (car nexp) 'o*)
         (* (value-prefix (1st-sub-exp nexp))
            (value-prefix (2nd-sub-exp nexp))))
        ((eq? (car nexp) 'o^)
         (expt (value-prefix (1st-sub-exp nexp))
               (value-prefix (2nd-sub-exp nexp))))
        (else #f))))
{{< /highlight >}}

From this chapter we begin to **design different functions for different syntax
setting functions**, we know this work will not be limited to `(1 + 1) and (+1
1)`. Actually, the syntactic/symbolic expression can be in any form, such as: if
0 is written as `quote()`, then 4 can be written as `(() () () ()) or
((((()))))`. Accordingly, the numberic operations can be written as:

{{< highlight scheme >}}
; sero? just like zero?
  ; sero? just like zero?
  (define sero?
    (lambda (n)
      (null? n)))

  ; edd1 just like add1
  (define edd1
    (lambda (n)
      (cons '() n)))

  ; zub1 just like sub1
  (define zub1
    (lambda (n)
      (cdr n)))

  ; .+ just like o+
  ;(.+ '(()) '(() ())) -> '(() () ())
  (define .+
    (lambda (n m)
      (cond
        ((sero? m) n)
        (else
          (edd1 (.+ n (zub1 m)))))))

  ; tat? just like lat?
  ;(tat? '((()) (()()) (()()()))) -> #f
  (define tat?
    (lambda (l)
      (cond
        ((null? l) #t)
        ((atom? (car l))
         (tat? (cdr l)))
        (else #f))))
{{< /highlight >}}
